app/controllers/posts_controller.rb

INSERT INTO "posts" ("latitude", "longitude", "usernotes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", 40.73581157695217], ["longitude", -73.99386405944824], ["usernotes", "damn he bleeding"], ["created_at", "2015-11-10 20:31:06.385642"], ["updated_at", "2015-11-10 20:31:06.385642"]]
---
	def create
		@post = Post.new(post_params)
		@post.save