app/controllers/session_controller.rb

  def create
    responder = Responder.find_by username: responder_params[:username]

    if responder && responder.authenticate(responder_params[:password])

      token = SecureRandom.urlsafe_base64
      session[:session_token] = token
      responder.update(session_token: token)
---
SELECT  "responders".* FROM "responders" WHERE "responders"."username" = $1 LIMIT 1  [["username", "user2"]]
UPDATE "responders" SET "session_token" = $1, "updated_at" = $2 WHERE "responders"."id" = $3  [["session_token", "H3dlaHVUZwOVsogSwkYyOg"], ["updated_at", "2015-11-10 20:01:32.238649"], ["id", 2]]